GopalSaraf/Practicals/PSDL/include/proc/pic16f1512.inc
// Register: TOSL
#define TOSL TOSL
TOSL                                     equ 0FEEh
// bitfield definitions
TOSL_TOSL_POSN                           equ 0000h
TOSL_TOSL_POSITION                       equ 0000h
TOSL_TOSL_SIZE                           equ 0008h
TOSL_TOSL_LENGTH                         equ 0008h
TOSL_TOSL_MASK                           equ 00FFh

// Register: TOSH
#define TOSH TOSH
TOSH                                     equ 0FEFh
// bitfield definitions
TOSH_TOSH_POSN                           equ 0000h
TOSH_TOSH_POSITION                       equ 0000h
TOSH_TOSH_SIZE                           equ 0007h
TOSH_TOSH_LENGTH                         equ 0007h
TOSH_TOSH_MASK                           equ 007Fh

// Register: AADCON0
#define AADCON0 AADCON0
AADCON0                                  equ 0711h
// bitfield definitions
AADCON0_ADON_POSN                        equ 0000h
AADCON0_ADON_POSITION                    equ 0000h
AADCON0_ADON_SIZE                        equ 0001h
AADCON0_ADON_LENGTH                      equ 0001h
AADCON0_ADON_MASK                        equ 0001h
AADCON0_GO_nDONE_POSN                    equ 0001h
AADCON0_GO_nDONE_POSITION                equ 0001h
AADCON0_GO_nDONE_SIZE                    equ 0001h
AADCON0_GO_nDONE_LENGTH                  equ 0001h
AADCON0_GO_nDONE_MASK                    equ 0002h
AADCON0_CHS0_POSN                        equ 0002h
AADCON0_CHS0_POSITION                    equ 0002h
AADCON0_CHS0_SIZE                        equ 0001h
AADCON0_CHS0_LENGTH                      equ 0001h
AADCON0_CHS0_MASK                        equ 0004h
AADCON0_CHS1_POSN                        equ 0003h
AADCON0_CHS1_POSITION                    equ 0003h
AADCON0_CHS1_SIZE                        equ 0001h
AADCON0_CHS1_LENGTH                      equ 0001h
AADCON0_CHS1_MASK                        equ 0008h
AADCON0_CHS2_POSN                        equ 0004h
AADCON0_CHS2_POSITION                    equ 0004h
AADCON0_CHS2_SIZE                        equ 0001h
AADCON0_CHS2_LENGTH                      equ 0001h
AADCON0_CHS2_MASK                        equ 0010h
AADCON0_CHS3_POSN                        equ 0005h
AADCON0_CHS3_POSITION                    equ 0005h
AADCON0_CHS3_SIZE                        equ 0001h
AADCON0_CHS3_LENGTH                      equ 0001h
AADCON0_CHS3_MASK                        equ 0020h
AADCON0_CHS4_POSN                        equ 0006h
AADCON0_CHS4_POSITION                    equ 0006h
AADCON0_CHS4_SIZE                        equ 0001h
AADCON0_CHS4_LENGTH                      equ 0001h
AADCON0_CHS4_MASK                        equ 0040h
AADCON0_CHS_POSN                         equ 0002h
AADCON0_CHS_POSITION                     equ 0002h
AADCON0_CHS_SIZE                         equ 0005h
AADCON0_CHS_LENGTH                       equ 0005h
AADCON0_CHS_MASK                         equ 007Ch

// Register: AADCON1
#define AADCON1 AADCON1
AADCON1                                  equ 0712h
// bitfield definitions
AADCON1_ADPREF0_POSN                     equ 0000h
AADCON1_ADPREF0_POSITION                 equ 0000h
AADCON1_ADPREF0_SIZE                     equ 0001h
AADCON1_ADPREF0_LENGTH                   equ 0001h
AADCON1_ADPREF0_MASK                     equ 0001h
AADCON1_ADPREF1_POSN                     equ 0001h
AADCON1_ADPREF1_POSITION                 equ 0001h
AADCON1_ADPREF1_SIZE                     equ 0001h
AADCON1_ADPREF1_LENGTH                   equ 0001h
AADCON1_ADPREF1_MASK                     equ 0002h
AADCON1_ADCS0_POSN                       equ 0004h
AADCON1_ADCS0_POSITION                   equ 0004h
AADCON1_ADCS0_SIZE                       equ 0001h
AADCON1_ADCS0_LENGTH                     equ 0001h
AADCON1_ADCS0_MASK                       equ 0010h
AADCON1_ADCS1_POSN                       equ 0005h
AADCON1_ADCS1_POSITION                   equ 0005h
AADCON1_ADCS1_SIZE                       equ 0001h
AADCON1_ADCS1_LENGTH                     equ 0001h
AADCON1_ADCS1_MASK                       equ 0020h
AADCON1_ADCS2_POSN                       equ 0006h
AADCON1_ADCS2_POSITION                   equ 0006h
AADCON1_ADCS2_SIZE                       equ 0001h
AADCON1_ADCS2_LENGTH                     equ 0001h
AADCON1_ADCS2_MASK                       equ 0040h
AADCON1_ADFM_POSN                        equ 0007h
AADCON1_ADFM_POSITION                    equ 0007h
AADCON1_ADFM_SIZE                        equ 0001h
AADCON1_ADFM_LENGTH                      equ 0001h
AADCON1_ADFM_MASK                        equ 0080h
AADCON1_ADPREF_POSN                      equ 0000h
AADCON1_ADPREF_POSITION                  equ 0000h
AADCON1_ADPREF_SIZE                      equ 0002h
AADCON1_ADPREF_LENGTH                    equ 0002h
AADCON1_ADPREF_MASK                      equ 0003h
AADCON1_ADCS_POSN                        equ 0004h
AADCON1_ADCS_POSITION                    equ 0004h
AADCON1_ADCS_SIZE                        equ 0003h
AADCON1_ADCS_LENGTH                      equ 0003h
AADCON1_ADCS_MASK                        equ 0070h

// Register: AADCON2
#define AADCON2 AADCON2
AADCON2                                  equ 0713h
// bitfield definitions
AADCON2_TRIGSEL0_POSN                    equ 0004h
AADCON2_TRIGSEL0_POSITION                equ 0004h
AADCON2_TRIGSEL0_SIZE                    equ 0001h
AADCON2_TRIGSEL0_LENGTH                  equ 0001h
AADCON2_TRIGSEL0_MASK                    equ 0010h
AADCON2_TRIGSEL1_POSN                    equ 0005h
AADCON2_TRIGSEL1_POSITION                equ 0005h
AADCON2_TRIGSEL1_SIZE                    equ 0001h
AADCON2_TRIGSEL1_LENGTH                  equ 0001h
AADCON2_TRIGSEL1_MASK                    equ 0020h
AADCON2_TRIGSEL2_POSN                    equ 0006h
AADCON2_TRIGSEL2_POSITION                equ 0006h
AADCON2_TRIGSEL2_SIZE                    equ 0001h
AADCON2_TRIGSEL2_LENGTH                  equ 0001h
AADCON2_TRIGSEL2_MASK                    equ 0040h
AADCON2_TRIGSEL_POSN                     equ 0004h
AADCON2_TRIGSEL_POSITION                 equ 0004h
AADCON2_TRIGSEL_SIZE                     equ 0003h
AADCON2_TRIGSEL_LENGTH                   equ 0003h
AADCON2_TRIGSEL_MASK                     equ 0070h

